Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Seven Years Later.tmx
Source language: en
Languages: es_419

source: Where to?
es_419: ¿A dónde?

source: and I've also watched the one titled QnA.
es_419: También vi el de preguntas y respuestas.

source: Hey...
es_419: Ey…

source: Ooooh, technology...
es_419: Aaay, lo que es la tecnología.

source: so, you can't go back to your youth again?
es_419: Entonces, ¿no puedes volver a ser joven?

source: BEEEEEEEP
es_419: BIIIIIIP

source: They say home feels like heaven...
es_419: Dicen que tener un hogar es una bendición…

source: Huh?!
es_419: ¡¿Eh?!

source: I heard many people wanted to go to Alanka Hotel.
es_419: He oído que mucha gente quiere ir al Hotel Alanka.

source: Don't you dare touch me!
es_419: ¡No te atrevas a tocarme!

source: come here, ara.
es_419: Ven aquí, Ara.

source: Don't try to change the subject!
es_419: ¡No intentes cambiar de tema!

source: What is it, dear?
es_419: ¿Qué pasa, mi niña?

source: to the past!
es_419: ¡Al pasado!

source: READ
es_419: LEÍDO

source: Well...
es_419: Bueno…

source: However, his response was...
es_419: Pero su respuesta fue…

source: he didn't believe it, so he came here to make sure.
es_419: No le creyó, así que vino hasta aquí para comprobarlo.

source: I couldn't tell him...
es_419: No le pude decir

source: ...you can travel back to seven years ago.
es_419: … podrás volver al pasado, siete años atrás.

source: He won't budge.
es_419: No va a ceder.

source: Would you extend my gratitude to her once again?
es_419: ¿podrías decirle otra vez que estoy muy agradecida?

source: you hear ezra calling you, right?
es_419: Escuchas que te está llamando, ¿no?

source: ...my soon-to-be husband!
es_419: … mi futuro esposo!

source: You slept all night on New Year's Eve.
es_419: Dormiste toda la noche de Año Nuevo.

source: I know.
es_419: Ya sé.

source: WIPE
es_419: LIMPIA

source: Wait a minute.
es_419: Espera un momento.

source: Ah, it's not that amazing.
es_419: Ay, no es para tanto.

source: Did you come here with your parents?
es_419: ¿Viniste con tus papás?

source: throb
es_419: TUTÚN

source: ...but not in this moment.
es_419: Pero no en este tiempo.

source: If you're sick,
es_419: Si te enfermas,

source: CHAPTER 4:
es_419: CAPÍTULO 4:

source: mom asked if you're...
es_419: Mamá quiere saber si…

source: The locals removed the love locks since they caused damages to the bridge.
es_419: Los vecinos quitaron los candados de amor porque dañaban el puente.

source: ...I welcomed him.
es_419: … fui a recibirlo.

source: I haven't told you...
es_419: No te dije nada…

source: but then you appeared out of the blue...
es_419: Y luego apareciste así de la nada.

source: why did he even say that?!
es_419: ¡¿Por qué dijo eso?!

source: yesterday you called me "big sister."
es_419: Ayer me llamaste "hermana mayor".

source: How is this possible?!
es_419: ¡¿Cómo es posible?!

source: ...is also a time traveler!
es_419: ¡también puede viajar en el tiempo!

source: Oh, yeah.
es_419: Ay, sí.

source: I'm still the same as I was seven years ago.
es_419: Sigo siendo la misma que hace siete años.

source: kala, let's go!
es_419: ¡Kala, vamos!

source: gavin didn’t tell me anything about this.
es_419: Gavin no me dijo nada de esto.

source: I've got an extra helmet, you can ride with me.
es_419: Tengo otro casco, te puedo llevar.

source: Don't panic!
es_419: ¡Tranquila!

source: Your call.
es_419: Tú decides.

source: well, do you mind...
es_419: Bueno, ¿te gustaría…

source: My friend whisked me away to Bali for New Year's Eve.
es_419: Mi amigo me trajo a Bali para pasar Año Nuevo juntos.

source: it smells and looks like it always has.
es_419: Se ve y huele igual que siempre.

source: VRRR
es_419: BRRR

source: here's some snacks for you!
es_419: ¡Toma algo de comida!

source: That's really what happened, sir!
es_419: Señor, eso fue lo que pasó, ¡de verdad!

source: I was so scared, ezra...
es_419: Tenía mucho miedo, Ezra.

source: Read 9:05 PM
es_419: Leído 9:05 p. m.

source: What's her name?
es_419: ¿cómo se llama?

source: Mom...
es_419: Mamá…

source: I'm 17 now--
es_419: Tengo 17.

source: CLICK
es_419: CLIC

source: ...But nothing happened to her head.
es_419: … pero no tenía nada.

source: I wish that was it...
es_419: Ojalá fuera así,

source: I do remember your voice, what you were wearing, and how you behaved...
es_419: Sí recuerdo tu voz, lo que llevabas puesto y tu manera de ser.

source: february 28, 2013
es_419: 28 de febrero de 2013

source: HUH?
es_419: ¿Qué?

source: of course not. she's not going anywhere.
es_419: Claro que no. Kala no irá a ningún lado.

source: Let's go to Bali!
es_419: ¡Vamos a Bali!

source: Don't let your emotion control you.
es_419: No dejes que tus emociones te controlen.

source: ...Do you remember where exactly you were just before you drowned?
es_419: … ¿Recuerdas dónde estabas exactamente antes de ahogarte?

source: thinking you're alive, while they thought otherwise.
es_419: al creer que estabas viva. Todos ellos decían lo contrario.

source: Fine, I'll pinch you then.
es_419: Bueno, pues te pellizco.

source: y-yes...
es_419: S-sí…

source: (even though I don't understand at all)
es_419: (aunque no entiendo nada)

source: he got my hopes up for nothing.
es_419: ¡Me hizo ilusionar para nada!

source: there, there.
es_419: Ya, tranquila.

source: 9:05 PM PM
es_419: 9:05 p. m.

source: hello?
es_419: ¿Hola?

source: I know we will meet again.
es_419: Sé que nos volveremos a encontrar.

source: ara! kala! time to eat!
es_419: ¡Ara! ¡Kala! ¡A comer!

source: Then how do you communicate with everyone?
es_419: ¿Y entonces cómo se comunican con los demás?

source: HA
es_419: JA

source: Easy...
es_419: Con calma…

source: my drowning...
es_419: Cuando me ahogué…

source: yeah, she's also a model on the side!
es_419: ¡Sí! ¡Y también es modelo!

source: ...after seven years, she eventually returned.
es_419: … que después de siete años, regresaría.

source: That was seven years ago!
es_419: ¡Eso fue hace siete años!

source: you're not from here, right?!
es_419: No eres de aquí, ¿verdad?

source: Didn't you tell me you wanted to surf?
es_419: ¿No me dijiste que querías surfear?

source: I always try to do my best when it comes to finding missing children.
es_419: Siempre intento hacer lo mejor cuando se trata de encontrar niños desaparecidos.

source: Gavin, did you know that Ezra has the same bracelet like ours?
es_419: Gavin, sabías que Ezra tiene el mismo brazalete que nosotros?

source: Ezra, help me upload a photo to the family group chat.
es_419: Ezra, ayúdame a enviar una foto en el chat grupal de la familia.

source: you've changed a lot!!!
es_419: ¡¡Cambiaste mucho!!

source: I'm so happy to see you, kala.
es_419: Me hace tan feliz verte, Kala.

source: See?
es_419: ¿Lo ven?

source: You call me a troublesome kid when I always listen to you!
es_419: Dices que soy problemática, ¡pero siempre te hago caso!

source: you were the one who wanted to take a break, and yet you called me.
es_419: Tú fuiste la que quería tomarse un tiempo, pero ahora me llamas.

source: so I'm the one who picks up and drops off mom.
es_419: Así que yo me encargo de llevar y traer a mamá.

source: THUMP
es_419: TUTÚN

source: our neighbors THOUGHT she WAS insane.
es_419: Los vecinos pensaban que estaba loca.

source: BOO-HOO!
es_419: ¡BUUAA!

source: ...to face what may come next...
es_419: para afrontar lo que depare el futuro.

source: I wanna change the fact that I've visited bali.
es_419: Quiero cambiar el hecho de que fui a Bali.

source: Relax, I'm a doctor.
es_419: Tranquila, soy doctora.

source: However, there was no solid evidence at the scene.
es_419: pero no había ninguna prueba contundente de ello.

source: Okay...
es_419: Bueno.

source: COUGH
es_419: COF

source: *in MOBA games, ranked game or simply ranked is a competitive seasonal game mode that runs for months.
es_419: *En los juegos MOBA, las partidas clasificatorias consisten en juegos competitivos estacionales que se desarrollan durante meses.

source: Then, let's go to our next destination!!!
es_419: ¡¡Entonces, vayamos a nuestro próximo destino!!

source: maybe that's why ezra rushed to lembang.
es_419: Quizás por eso Ezra se apuró para ir a Lembang.

source: Ezra is waiting outside.
es_419: Ezra te está esperando afuera.

source: ...WHO LOOKS JUST LiKE ME.
es_419: que se veía igual a mí.

source: What about Mr. Agung?
es_419: ¿Qué hay del Sr. Agung?

source: come to think of it, it is weird.
es_419: Ahora que lo pienso, es raro.

source: Ga-Gavin and I also have this.
es_419: Ga-Gavin y yo también tenemos esto.

source: ...this matching bracelet.
es_419: … juego de brazaletes.

source: She also happened to run away, and her dad came to Bali just to look for her.
es_419: Ella también se escapó de su casa, y su papá vino a Bali a buscarla.

source: ...me.
es_419: … fui yo.

source: what the hell was that?!
es_419: ¡¿Qué demonios fue eso?!

source: what could have troubled your young mind so much?
es_419: ¿Qué es lo que te tiene tan preocupada a tu edad?

source: haha there was a moment where she boldly brought a lip tint to school,
es_419: Ja, ja. Me acuerdo que una vez se atrevió a llevar un lápiz labial a la escuela.

source: help...
es_419: ¡Ayuda!

source: mom, listen to this!
es_419: ¡Mamá, escucha esto!

source: So... it's just us two who made it here.
es_419: Así que… solo nosotras pudimos venir hasta aquí.

source: so we can have fun now, can't we?
es_419: Entonces ahora podemos divertirnos, ¿no crees?

source: And he'll also scold me because of her scores.
es_419: Y también me va a regañar a mí por sus calificaciones.

source: You're seventeen, right?
es_419: Tienes diecisiete, no?

source: ARGH!
es_419: ¡AAAH!

source: Pinch me, please!
es_419: ¡Pellízcame, por favor!

source: and then suddenly I hit rock bottom.
es_419: a estrellarme contra el suelo.

source: kala, let's wait for ezra.
es_419: Kala, esperemos a Ezra.

source: Ah, I'm okay...
es_419: Sí, estoy bien…

source: what the heck?!
es_419: ¡¿Qué demonios?!

source: ...I'm sukma.
es_419: Soy Sukma.

source: She...
es_419: Ella…

source: Till I fell asleep.
es_419: Hasta que me dormí.

source: deal!
es_419: ¡Acepto!

source: CHAPTER 18:
es_419: CAPÍTULO 18:

source: Thank you so much.
es_419: Muchas gracias.

source: they said, "please introduce your boyfriend to us."
es_419: Algunos me pedían que les presentara a mi novio.

source: HUFF
es_419: UFF

source: besides, this isn't an uncommon bracelet.
es_419: Además, esta pulsera es bastante común.

source: coming!
es_419: ¡Voy!

source: I'm...
es_419: Soy…

source: you know, dad's in jakarta.
es_419: Sabes que papá está en Yakarta.

source: what else that I can find here...?
es_419: ¿Qué más hay para ver aquí?…

source: Hmm...
es_419: Mmm.

source: why did you give the bracelet to ezra?
es_419: ¿Por qué le diste el brazalete a Ezra?

source: no, mom.
es_419: No, ma.

source: where's ingrid?
es_419: ¿Dónde está Ingrid?

source: Just stop!
es_419: ¡Ya basta!

source: I'm afraid Dad will scold me!
es_419: ¡Creo que papá me va a regañar!

source: whoa, she's good at doing makeup?
es_419: Guau. ¿Es buena con el maquillaje?

source: HEHEHE
es_419: JEJEJE

source: whenever we discussed our vacation with the others, you'd ask us to visit somewhere else.
es_419: Cada vez que hablábamos de las vacaciones con los demás, querías que fuéramos a otro lugar.

source: Who would pay for the hotel?
es_419: ¿Quién te va a pagar el hotel?

source: So, he comes here every year?
es_419: ¿Así que viene todos los años?

source: DECEMBER 30, 2013
es_419: 30 DE DICIEMBRE DE 2013

source: gavin proceeded to show me more of ingrid's videos at the cafe.
es_419: Gavin siguió mostrándome más videos de Ingrid en la cafetería.

source: Fire!
es_419: ¡Fuego!

source: now, try to remember,
es_419: Ahora, trata de recordar.

source: and just before we left, gavin said something to me.
es_419: Pero antes de irnos, Gavin me dijo algo más.

source: Well, you have no idea how Dad--
es_419: Mira, no tienes ni idea de lo que papá…

source: I can't...
es_419: No puedo.

source: Maybe Dad was right...
es_419: Tal vez papá tenía razón…

source: oh, sorry.
es_419: Ay, perdón.

source: What?!
es_419: ¡¿Qué?!

source: except for this...
es_419: A excepción de esto…

source: Hey.
es_419: Ey.

source: RUB
es_419: FROTA

source: I'm just shocked to learn that she's gone.
es_419: Pero me sorprendió mucho que se haya ido.

source: Surprisingly, my dad showed up here...
es_419: Pero mi papá apareció aquí…

source: ara, please come with me and gavin to lembang!
es_419: Ara, ¡ven conmigo y con Gavin a Lembang!

source: GRAB
es_419: AGARRA

source: I'm full.
es_419: Estoy llena.

source: A girl...
es_419: Una chica

source: TSK
es_419: TCH

source: I'm not alone.
es_419: No estoy sola.

source: A GOLDEN CAGE
es_419: UNA JAULA DORADA

source: I wasn't in a position to tell you about that, so--
es_419: No estaba en condiciones de decírtelo y…

source: CHAPTER 2:
es_419: CAPÍTULO 2:

source: I'll just stay in the cafe.
es_419: Me quedo en la cafetería.

source: HAHA HAHA,
es_419: Ja, ja, ja.

source: What should I reply to him??!
es_419: ¡¿Qué le respondo?!

source: you should've asked ezra instead.
es_419: Tendrías que preguntarle a Ezra.

source: ...I did thank her for everything, but...
es_419: Ya le di las gracias por todo a la chica, pero…

source: it feels like a feeling of deja vu.
es_419: Se siente como una especie de déjà vu.

source: you need to focus!
es_419: ¡Concéntrate!

source: Hahaha!
es_419: Jajaja!

source: from what you told me...
es_419: por lo que cuentas,

source: kala! you have a guest!
es_419: ¡Kala! ¡Tienes visita!

source: go to the past!
es_419: ¡Vamos al pasado!

source: five minutes later
es_419: Cinco minutos después

source: how can I go back to ezra...
es_419: ¿Cómo hago para volver con Ezra?

source: The matching couple ones.
es_419: Las que hacen juego.

source: Yeah, Dad's always busy with work, so he's never taken us on vacation with him.
es_419: Sí. Papá siempre tiene mucho trabajo, así que nunca pudo llevarnos de vacaciones.

source: Pull yourself together.
es_419: ¡Cálmate!

source: How did you end up almost drowning?
es_419: ¿Cómo es que casi te ahogas?

source: Wh-What are you doing?
es_419: ¿Q-qué haces?

source: when I heard that she was presumed dead,
es_419: Cuando me enteré de que la daban por muerta,

source: Thanks for saving me, Ezra...
es_419: Gracias por salvarme, Ezra.

source: you asked me about the matching bracelet, right?
es_419: Me preguntaste sobre el brazalete, ¿verdad?

source: s-so--
es_419: E-entonces…

source: kala's dad is still in jakarta, ma'am?
es_419: ¿El papá de Kala sigue en Yakarta, señora?

source: But then again, I was right.
es_419: Pero tenía razón.

source: What would you do if you couldn’t go anywhere whenever you felt like it?
es_419: ¿Qué harías si no pudieras ir a ninguna parte cuando quisieras?

source: What if Ara followed your delinquency?!
es_419: ¡¿Qué pasaría si Ara siguiera esa rebeldía tuya?!

source: Yeah
es_419: Sí

source: HAHAHA
es_419: JAJAJA

source: no, sir.
es_419: No, señor.

source: He came to the funeral,
es_419: Vino al funeral

source: somehow...
es_419: de alguna manera,

source: ...everything makes sense now.
es_419: … ahora todo tiene sentido.

source: don't ever think to travel to the past just for a guy! certainly not worth the effort!
es_419: ¡Y ni se te ocurra viajar al pasado por un chico! ¡No vale la pena!

source: Well, the plan was for the three of us to meet you.
es_419: Bueno, quedamos en que nos íbamos a reunir los tres contigo.

source: ...but come to think of it...
es_419: Pero ahora que lo pienso…

source: The whole class is going to watch Prozen later.
es_419: Toda la clase va a ir a ver Prozen más tarde.

source: don't go anywhere, you two!
es_419: ¡No se vayan a ningún lado!

source: COUGH!
es_419: COF

source: I'm tired.
es_419: Estoy cansado.

source: Why are you still up?
es_419: ¿Por qué sigues despierta?

source: I just nodded.
es_419: Simplemente asentí.

source: and honestly, us going to bali evoked the most bitter memory in my life.
es_419: El viaje a Bali hizo que reviviera los recuerdos más amargos de mi vida.

source: The last thing I remember was...
es_419: Lo último que recuerdo es que…

source: grandma said to focus on him...
es_419: La abuela dijo que me enfocara en él.

source: Together
es_419: Juntos

source: Ingrid Gayatri 5.4M views 7 months ago
es_419: Ingrid Gayatri 5.4M vistas Hace 7 meses

source: my heart said, "haven't you learned your lesson?"
es_419: mi corazón exclamó, "¿acaso no aprendiste la lección?".

source: I don't even know how to answer Ezra.
es_419: Ni siquiera sé qué contestarle a Ezra.

source: Chapter 8:
es_419: CAPÍTULO 8:

source: but I need to return before my dad gets worked up.
es_419: Tengo que volver con mi papá antes de que se ponga nervioso.

source: How can I be here in the future?
es_419: ¿Cómo es posible que esté en el futuro?

source: GLITTER
es_419: BRILLANTE

source: gavin, why did you give the bracelet to ezra?
es_419: Gavin, ¿por qué le diste el brazalete a Ezra?

source: How in the world is it possible?
es_419: ¿Cómo diablos es eso posible?

source: HAHA, Why would he, dear?
es_419: Ja, ja. ¿Por qué, mi chiquita?

source: What is it actually that made you this talented?
es_419: ¿Qué es lo que te hizo tener todo este talento?

source: Her voice...
es_419: Su voz…

source: Dad brings up Ara again and again...
es_419: Papá siempre mete a Ara en esto, una y otra vez.

source: (a quote from a movie)
es_419: (frase de una película)

source: You have to be careful while swimming at the beach.
es_419: Tienen que tener cuidado cuando nadan en la playa.

source: ummm...
es_419: Hum…

source: Put out the fire!
es_419: ¡Apaguen el fuego!

source: I want the drumsticks!
es_419: ¡Quiero los muslos!

source: maybe it's her fate to become a beauty content creator.
es_419: Quizás estaba destinada a ser creadora de contenido.

source: thud
es_419: PUM

source: ...you're now in the time where I exist.
es_419: Ahora estás en la época en la que yo existo.

source: yes, gavin?
es_419: ¿Sí, Gavin?

source: Okay!
es_419: Bueno!

source: ...and kala was one of them.
es_419: Kala también estaba.

source: no reason.
es_419: Nada en particular.

source: How are you here already?
es_419: ¿Cómo es que ya estás aquí?

source: really?! which ones?
es_419: ¡¿En serio?! ¿Cuáles?

source: one more thing, you'll have to ride with ara.
es_419: Una cosa más. Ara te tiene que llevar.

source: they say the moon's gravity pulls on the water in the oceans.
es_419: Dicen que la gravedad de la luna atrae el agua de los océanos.

source: I shouldn't have insisted you come to Bali.
es_419: No debería haber insistido en que vinieras.

source: anything you'd like to buy?
es_419: ¿Quieres comprar algo?

source: I guess she must've been angry with my dad,
es_419: Supongo que se enojó mucho con mi papá

source: I'm in 2021.
es_419: Yo estoy en el 2021.

source: Thank you, Ezra, for bringing Kala to us.
es_419: Gracias, Ezra, por traernos a Kala de vuelta.

source: Maybe it just happened to look similar to ours...
es_419: Quizás solo es parecido a los que teníamos.

source: And I keep hearing her words in my head.
es_419: Esas palabras siguen resonando en mi cabeza.

source: whoa, fried chicken!
es_419: ¡Guau! ¡Pollo frito!

source: where you don't have access to the internet.
es_419: donde no tienen acceso a internet.

source: you can play that game anytime later.
es_419: Puedes jugar a eso en otro momento.

source: ...do you have to hold my hand the whole time?
es_419: … ¿tienes que llevarme de la mano todo el tiempo?

source: Ezra is trying to turn on the phone.
es_419: Ezra está tratando de prender el teléfono.

source: She fainted and you're a doctor, I don't know what else to do.
es_419: Se desmayó y tú eres doctora. No sé qué más hacer.

source: ...I still feel there's something else he's not telling me.
es_419: … siento que hay algo más que no me está contando.

source: Ara wouldn't have failed her exams if you had taught her better!
es_419: ¡Ara no habría desaprobado sus exámenes si hubieras sido un mejor ejemplo!

source: Whoa!
es_419: ¡Guau!

source: You get me?
es_419: ¿Entendiste?

source: the title immediately made me curious.
es_419: El título enseguida me llamó la atención.

source: hope you'll always wear it from now on.
es_419: Espero que siempre lo lleves contigo.

source: SOB
es_419: BUA

source: it hurts so much.
es_419: Me dolió tanto.

source: Come on, you'll see.
es_419: Vamos, ya verás.

source: isn't she a pharmacist by now?
es_419: ¿Ya es farmacéutica?

source: now I don't know what to do.
es_419: Y ahora no sé qué hacer.

source: yes?
es_419: ¿Sí?

source: Who wouldn't cry when seeing their mom shed tears?
es_419: ¿Quién no lloraría al ver a su propia madre envuelta en llanto?

source: But Bali is too far, Kala.
es_419: Pero Bali está muy lejos, Kala.

source: ...and stronger...
es_419: y más fuerte

source: When we all went to Bali on December 31, 2013,
es_419: Fuimos todos a Bali el 31 de diciembre de 2013,

source: Now you can book a taxi online with a phone?
es_419: ¿Ahora se puede reservar un taxi con el teléfono?

source: how much did you drink?
es_419: ¿Cuánto bebiste?

source: 220, 898, 482 SECOND
es_419: 220 898 482 SEGUNDOS

source: I can't help you right now.
es_419: No puedo ayudarte ahora.

source: EZRA 18 years old
es_419: EZRA 18 AÑOS

source: SOB SOB
es_419: BUA BUA

source: ...and you said you came from 2003.
es_419: Y dijiste que venías del año 2003.

source: she's the best when it comes to lip stains! haha.
es_419: ¡Ingrid sabe muchísimo sobre labiales! Ja, ja.

source: POLICE DEPARTMENT AGUNG
es_419: DEPARTAMENTO DE POLICÍA AGUNG

source: CHIRP
es_419: PÍO

source: I suddenly remember what Grandma said...
es_419: De repente me acordé de lo que dijo la abuela…

source: I also think you're weird, by the way--
es_419: También creo que eres algo rara, por cierto…

source: PFTTT
es_419: PFFF

source: what happened?
es_419: ¿Qué pasó?

source: it's okay, mom...
es_419: Está bien, mamá…

source: you should go back to bandung now.
es_419: Ya es hora de que regreses a Bandung.

source: Listen carefully.
es_419: Escucha bien.

source: still works even though the screen is cracked.
es_419: Tiene la pantalla rota pero todavía funciona.

source: I didn't experience the fire like you did, kala.
es_419: Yo no viví ese incendio, Kala.

source: how's life--
es_419: ¿Cómo va to…?

source: Do you want--
es_419: ¿Quieres…?

source: BOOM
es_419: BUM

source: it wasn't the case for my grandma!
es_419: ¡mi abuela no fue el caso!

source: I'm so sorry...
es_419: Perdóname.

source: but because I was selfish, I insisted you to go...
es_419: Pero fui egoísta y te insistí para que fueras…

source: Let go!
es_419: ¡Suéltame!

source: Does Ezra know about this?
es_419: ¿Y Ezra lo sabe?

source: I was one of the survivors...
es_419: Fui uno de los sobrevivientes…

source: Huh, I can’t believe This! you've been spending your time with another girl?!
es_419: ¿Qué? ¡No puedo creerlo! ¡¿Estuviste todo este tiempo con otra chica?!

source: was told to?
es_419: ¿Te dijeron?

source: We all agreed to whisk you away tonight.
es_419: Nos pusimos de acuerdo para llevarte esta noche.

source: ezra is coming here to explain--
es_419: Ezra viene para explicarte…

source: okay, I will.
es_419: Claro, lo haré.

source: maybe I should ask gavin.
es_419: Debería preguntarle a Gavin.

source: I promise!
es_419: ¡Lo prometo!

source: I don't know yet...
es_419: No lo sé aún…

source: H
es_419: U

source: a glitch in the system...
es_419: Un error en el sistema…

source: 100 for physics.
es_419: 100 en física.

source: I've never been to a beach.
es_419: Nunca fui a la playa.

source: CHAPTER 5:
es_419: CAPÍTULO 5:
